# IsValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..IsValid Method
Alignment Class See Also
---
Checks if this object is a valid alignment.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# See Also
Alignment Class
IsValid Overload
Autodesk.Revit.DB.Infrastructure Namespace